import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-test-page',
  templateUrl: './test-page.component.html',
  styleUrls: ['./test-page.component.scss']
})
export class TestPageComponent implements OnInit {

  showPreview = true;
  quiz = [
    {
      q1: 'Проза',
      q2: 'Детектив',
      q3: 'Фантастика',
      q4: 'Любовный роман',
      q5: 'Приключения',
      title: 'Какому жанру вы бы отдали предпочтение прямо сейчас?'
    },
    {
      q1: 'Романтический XIX век',
      q2: 'Начало XX века',
      q3: 'Современность',
      q4: 'Далекое будущее',
      q5: 'Не вижу смысла в привязке по времени, главное, чтобы информация была полезной',
      title: 'О каком времени вы больше всего любите читать в книгах?'
    },
    {
      q1: 'Наблюдательный человек с хорошим чувством юмора',
      q2: 'Персонаж, который постоянно совершенствуется',
      q3: 'Герой с большой буквы: тот, кем можно восхищаться',
      q4: 'Человек, который не живет только своими проблемами, а пытается разобраться в окружающем мире',
      title: 'Каким бы вы хотели видеть главного героя?'
    },
    {
      q1: 'Полезная информация, которую из неё можно почерпнуть',
      q2: 'Реальность происходящего – сюжет можно примерить на себя',
      q3: 'Прекрасная фантазия автора',
      q4: 'Увлекательная история',
      q5: 'Многоплановость и множество сюжетных линий',
      title: 'Что самое ценное в хорошей книге?'
    },
    {
      q1: 'Поиск приключений',
      q2: 'Что-то космическое',
      q3: 'Самосовершенствование',
      q4: 'Тайна',
      q5: 'Любовь',
      title: 'Какое слово лучше всего характеризует ваше нынешнее состояние?'
    }
  ];
  activeQ = 0;

  constructor() { }

  ngOnInit(): void {
  }

  nextQuestion(): void {
    setTimeout(() => {
      this.activeQ += 1;
    }, 1000);
  }

}
